Repository: SashokNekulin/an-jwt-auth
Catalog: languages/an-jwt-auth-*.po
Languages: ru_ru

source: Settings
ru_ru: Настройки

source: JWT auth settings
ru_ru: Настройки JWT аутентификации.

source: JWT switch?
ru_ru: Использовать JWT аутентификацию?

source: Yes
ru_ru: Да

source: No
ru_ru: Нет

source: Access token lifetime in seconds
ru_ru: Время жизни access token в секундах

source: The lifetime of the refresh token in seconds
ru_ru: Время жизни refresh token в секундах

source: Use CORs?
ru_ru: Включить поддержку CORs?

source: Cross-origin resource sharing (<a href="https://en.wikipedia.org/wiki/Cross-origin_resource_sharing"> CORS </a>; with persistent. - "sharing resources between different sources")-a technology of modern browsers that allows you to provide a web page access to resources of another domain.
ru_ru: Cross-origin resource sharing (<a href="https://en.wikipedia.org/wiki/Cross-origin_resource_sharing"> CORS </a>; с англ. — «совместное использование ресурсов между разными источниками») — технология современных браузеров, которая позволяет предоставить веб-странице доступ к ресурсам другого домена.

source: Extends the WP REST API using JSON Web Tokens Authentication as an authentication method.
ru_ru: Расширяет API WP REST, используя аутентификацию веб-маркеров JSON в качестве метода аутентификации.

source: Alexandr Nikulin
ru_ru: Александр Никулин
